src/Reports/ИнформацияПоКлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИнформацияПоКлиенту</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<Comment>Статусы пациентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредстваНаЛицевыхСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаЛицевыхСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ПредпочтенияКлиентовПоМастерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПредпочтенияКлиентовПоМастерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РежимРаботыСетиСтоматологий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимРаботыСетиСтоматологий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕдинаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ИнформацияПоКлиенту/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, выполняет формирование отчета по информации клиента
//
Процедура ВывестиИнформациюПоКонграгенту(Контрагент, СтруктурнаяЕдиница, ТабличныйДокумент) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверка, выбран ли клиент
	Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не выбран клиент!'");
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Если не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	// Получение макета	
		
	Макет = Отчеты.ИнформацияПоКлиенту.ПолучитьМакет("Макет");
	
	// Формирование контактной информации
	СтрокаАдреса  = Контрагент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Адрес                ,"Тип"); 
	СтрокаТелефон = Контрагент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон              ,"Тип");
	СтрокаЕмайл   = Контрагент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
	
	Адрес   = ?(СтрокаАдреса  = Неопределено, "", СтрокаАдреса .Представление);
	Телефон = ?(СтрокаТелефон = Неопределено, "", СтрокаТелефон.Представление);
	Емайл   = ?(СтрокаЕмайл   = Неопределено, "", СтрокаЕмайл  .Представление);
	
	ЭтоСетьСтоматологий = (Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть);
	
	ЗапросОбщейИнформации = Новый Запрос;
	ЗапросОбщейИнформации.УстановитьПараметр("Клиент", Контрагент);
	ЗапросОбщейИнформации.УстановитьПараметр("СтруктурнаяЕдиница", ?(НЕ ЭтоСетьСтоматологий, СтруктурнаяЕдиница, Неопределено));
	ЗапросОбщейИнформации.Текст = ПолучитьЗапросОбщейИнформации();
	
	МассивРезультатов      	= ЗапросОбщейИнформации.ВыполнитьПакет(); 	
	ОбщаяИнформация        	= МассивРезультатов[0].Выгрузить();
	ПредпочтенияПоМастерам 	= МассивРезультатов[1].Выгрузить();
	СегментКлиента  		= МассивРезультатов[2].Выгрузить();
	ВыборкаПриемы		    = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВзаимодействия  	= МассивРезультатов[4].Выбрать();
	ВыборкаПланыЛечения 	= МассивРезультатов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНарядЗаказы   	= МассивРезультатов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// ===============================================ВЫВОД ОБЩИХ ДАННЫХ====================================================	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбщиеДанные");
	ОбластьЗаголовок.Параметры.ФИОКлиента   	= Контрагент.Фамилия + " "+Контрагент.Имя+" "+Контрагент.Отчество;
	Если Не Контрагент.ТекущаяМедицинскаяКарта.Пустая() Тогда 
		ОбластьЗаголовок.Параметры.НомерМедКарты = Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей;
	КонецЕсли;
	
	// Вывод КИ с учетом установленной роли пользователя
	ВыводОбщейИнформацииПоКонтрагенту(ОбластьЗаголовок, Контрагент, Адрес, Телефон, Емайл);
	
	Если ОбщаяИнформация.Количество() > 0 Тогда
		ОбластьЗаголовок.Параметры.ДатаПервогоПосещения    = Формат(ОбщаяИнформация[0].ДатаПервогоПосещения, "ДЛФ=DD");
		ОбластьЗаголовок.Параметры.ДатаПоследнегоПосещения = Формат(ОбщаяИнформация[0].ДатаПоследнегоПосещения, "ДЛФ=DD");
		
		Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			СуммаЗадолженности = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьОстатокПоВзаиморасчетамСконтрагентом(Контрагент,, СтруктурнаяЕдиница);		
			Если  СуммаЗадолженности > 0 Тогда
				ОбластьЗаголовок.Область("ОбластьДолгКлиента").ЦветТекста = WebЦвета.Красный;
				ОбластьЗаголовок.Параметры.ДолгКлиента  = ""+ ?(ЗначениеЗаполнено(СуммаЗадолженности), Формат(СуммаЗадолженности,"ЧДЦ=2; ЧРД=.") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти(), "0.00" + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
				ОбластьЗаголовок.Параметры.НадписьДолг = "Долг пациента:";
			Иначе	
				ОбластьЗаголовок.Параметры.ДолгКлиента  = ""+ ?(ЗначениеЗаполнено(СуммаЗадолженности), Формат(-СуммаЗадолженности,"ЧДЦ=2; ЧРД=.") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти(), "0.00" + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
				ОбластьЗаголовок.Параметры.НадписьДолг = "Наш долг перед пациентом:";
			КонецЕсли;
				
			ОбластьЗаголовок.Параметры.Остаток = ""+ ?(ЗначениеЗаполнено(ОбщаяИнформация[0].Остаток), Формат(ОбщаяИнформация[0].Остаток,"ЧДЦ=2; ЧРД=.") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти(), "0.00" + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
		КонецЕсли;
		Если ЗначениеЗаполнено(ОбщаяИнформация[0].Остаток) И ОбщаяИнформация[0].Остаток < 0 Тогда 
			ОбластьЗаголовок.Область("ОбластьОстаток").ЦветТекста = WebЦвета.Красный;			
		КонецЕсли;
		ОбластьЗаголовок.Рисунки["ПиктограммаПерейтиЛицевыеСчета"].Расшифровка  = "ОткрытьЛицевыеСчета";
		ОбластьЗаголовок.Рисунки["ПиктограммаПерейтиВзаиморасчеты"].Расшифровка = "ОткрытьВзаиморасчеты";
		
		СтруктураРасшифровкиОткрытьЛицевыеСчета = Новый Структура;
		СтруктураРасшифровкиОткрытьЛицевыеСчета.Вставить("ОткрытьЛицевыеСчетаКонтрагента", Контрагент);
		СтруктураРасшифровкиОткрытьВзаиморасчеты = Новый Структура;
		СтруктураРасшифровкиОткрытьВзаиморасчеты.Вставить("ОткрытьВзаиморасчетыКонтрагента", Контрагент);		
		ОбластьЗаголовок.Параметры.ОткрытьЛицевыеСчета = СтруктураРасшифровкиОткрытьЛицевыеСчета;
		ОбластьЗаголовок.Параметры.ОткрытьВзаиморасчеты = СтруктураРасшифровкиОткрытьВзаиморасчеты;
	КонецЕсли;
	
	ОбластьЗаголовок.Рисунки["ПиктограммаОткрытияФормыПечати"].Расшифровка = "ПечатьОтчета";
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// =========================================ВЫВОД ДОПОЛНИТЕЛЬНОЙ ИНФОРМАЦИИ=============================================	
	Если НЕ Контрагент.ДополнительныеРеквизиты.Количество() = 0 Тогда 		
		ОбластьДопИнформацияЗаголовок = Макет.ПолучитьОбласть("ДополнительнаяИнформацияЗаголовок");
		// ТабличныйДокумент.Вывести(ОбластьДопИнформацияЗаголовок);
		
		Для каждого Строка из Контрагент.ДополнительныеРеквизиты Цикл
			ОбластьДопИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформацияДанные");
			ОбластьДопИнформация.Параметры.Заполнить(Строка);
			// ТабличныйДокумент.Вывести(ОбластьДопИнформация);			
			ОбластьДопИнформацияЗаголовок.Присоединить(ОбластьДопИнформация);
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьДопИнформацияЗаголовок);
		
	КонецЕсли;
	
	// ===========================================ВЫВОД ПРЕДВАРИТЕЛЬНЫХ ЗАПИСЕЙ=============================================
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СобытиеУслуги.Ссылка КАК Ссылка,
	               |	СобытиеУслуги.Номенклатура КАК Номенклатура,
	               |	СобытиеУслуги.ПричинаЗаписи КАК ПричинаЗаписи,
	               |	СобытиеУслуги.Сотрудник КАК Сотрудник,
	               |	СобытиеУслуги.ДатаНачала КАК ДатаНачала,
	               |	СобытиеУслуги.Цена КАК Цена,
	               |	СобытиеУслуги.Ссылка.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.Событие.Услуги КАК СобытиеУслуги
	               |ГДЕ
	               |	СобытиеУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И СобытиеУслуги.ДатаНачала >= &ДатаНачала
	               |	И СобытиеУслуги.Ссылка.Статус = &Статус
	               |	И СобытиеУслуги.Ссылка.Контрагент = &Клиент
	               |	И СобытиеУслуги.Ссылка.Проведен";
					
	ЗапросЗаписи = Новый Запрос(ТекстЗапроса);
	ЗапросЗаписи.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	ЗапросЗаписи.УстановитьПараметр("Статус", Перечисления.СтатусыСобытия.Подтверждена);
	ЗапросЗаписи.УстановитьПараметр("Клиент",Контрагент);
	
	РезультатЗаписи = ЗапросЗаписи.Выполнить().Выбрать();

	Если РезультатЗаписи.Количество() > 0 Тогда
		
		ОбластьПредварительнаяЗаписьЗаголовок = Макет.ПолучитьОбласть("ПредварительнаяЗаписьЗаголовок");
		ОбластьПредварительнаяЗаписьЗаголовок.НайтиТекст("Печать талона").Расшифровка = "ОткрытьПечатьТалона";
		СтруктураРасшифровкиОткрытьПечатьТалона = Новый Структура;
		СтруктураРасшифровкиОткрытьПечатьТалона.Вставить("ОткрытьПечатьТалона", Контрагент);		
		ОбластьПредварительнаяЗаписьЗаголовок.Параметры.ОткрытьПечатьТалона = СтруктураРасшифровкиОткрытьПечатьТалона;

		ТабличныйДокумент.Вывести(ОбластьПредварительнаяЗаписьЗаголовок);
 		Пока РезультатЗаписи.Следующий() Цикл
			
			СтрокаЗапись = Формат(РезультатЗаписи.ДатаНачала,"ДФ='ддд дд ММММ ЧЧ:мм'") + ", " + Строка(РезультатЗаписи.Сотрудник) + ?(ЗначениеЗаполнено(РезультатЗаписи.ПричинаЗаписи), (", "+Строка(РезультатЗаписи.ПричинаЗаписи)), "") + ?(РезультатЗаписи.Цена <> 0, (", "+Строка(РезультатЗаписи.Цена)+" руб."), "");
			Секция = Макет.ПолучитьОбласть("ПредварительнаяЗаписьДанные");
			Секция.Параметры.СтрокаЗапись = СтрокаЗапись;
			Секция.Параметры.СтруктураЗапись = Новый Структура("СсылкаНаЗапись", РезультатЗаписи.Ссылка);
			Секция.Параметры.ДеньКалендаря = Новый Структура("ДеньКалендаря", РезультатЗаписи.ДатаНачала);
			ТабличныйДокумент.Вывести(Секция);
			
		КонецЦикла;
		
	КонецЕсли;

	// ============================================ВЫВОД ПОСЛЕДНИЕ МАСТЕРА==============================================	
	Если ПредпочтенияПоМастерам.Количество() > 0 Тогда
		ОбластьПредпочтенияМастераЗаголовок = Макет.ПолучитьОбласть("ПредпочтениеПоМастерамЗаголовок");
		// ТабличныйДокумент.Вывести(ОбластьПредпочтенияМастераЗаголовок);
		Для Каждого Мастер из ПредпочтенияПоМастерам Цикл
			ОбластьПредпочтенияМастера = Макет.ПолучитьОбласть("ПредпочтениеПоМастерамДанные");
			ОбластьПредпочтенияМастера.Параметры.Заполнить(Мастер);
			// ТабличныйДокумент.Вывести(ОбластьПредпочтенияМастера);
			ОбластьПредпочтенияМастераЗаголовок.Присоединить(ОбластьПредпочтенияМастера);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьПредпочтенияМастераЗаголовок);
	КонецЕсли;
	
	// =========================================ВЫВОД ПРИНАДЛЕЖИТ СЕГМЕНТАМ=============================================	
	Если СегментКлиента.Количество() > 0 Тогда
		ОбластьПринадлежностиСегментамЗаголовок = Макет.ПолучитьОбласть("ПринадлежитСегментамЗаголовок");
		ТабличныйДокумент.Вывести(ОбластьПринадлежностиСегментамЗаголовок);
		Для Каждого Сегмент из СегментКлиента Цикл
			ОбластьПринадлежностиСегментам = Макет.ПолучитьОбласть("ПринадлежитСегментамДанные");
			ОбластьПринадлежностиСегментам.Параметры.Заполнить(Сегмент);
			ТабличныйДокумент.Вывести(ОбластьПринадлежностиСегментам);
		КонецЦикла;
	КонецЕсли;

	// ============================================ВЫВОД СТРАХОВЫЕ ПОЛИСЫ===============================================	
	
	МассивПолисов = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(Контрагент, ТекущаяДата());
	
	Если МассивПолисов.Количество() <> 0 Тогда 
	
		Область_СтраховыеПолисы_Заголовок = Макет.ПолучитьОбласть("СтраховыеПолисы_Заголовок");
		ТабличныйДокумент.Вывести(Область_СтраховыеПолисы_Заголовок);
		
		Для Каждого СтраховойПолис Из МассивПолисов Цикл 
			
			
			Область_СтраховыеПолисы_Строка = Макет.ПолучитьОбласть("СтраховыеПолисы_Строка");
			ТипПолиса = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАббревиатуруТипаПолиса(СтраховойПолис.ТипПолиса);
			СтрокаПолис = ТипПолиса + ":  " + Строка(СтраховойПолис.СтраховаяКомпания) + "  № " + СтраховойПолис.СерияПолиса + "-" + СтраховойПолис.НомерПолиса + "  действителен с: "+ Формат(СтраховойПолис.ДанаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(СтраховойПолис.ДатаОкончания, "ДФ=dd.MM.yyyy") + ".    ";
			СуммаОказанныхУслуг = ПолучитьСуммуОказанныхУслугПоПолису(СтраховойПолис);			
			Если СтраховойПолис.ЛимитПолиса = 0 Тогда 
				ЛимитПолиса = "Сумма, оказанных услуг по полису: " + Формат(СуммаОказанныхУслуг, "ЧЦ=15; ЧДЦ=2; ЧН=") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				СтрокаПолис = СтрокаПолис + ЛимитПолиса;			
			Иначе 
				ЛимитПолиса = "Лимит: " + Формат(СтраховойПолис.ЛимитПолиса, "ЧЦ=15; ЧДЦ=2; ЧН=") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				Если СтраховойПолис.ЛимитПолиса - СуммаОказанныхУслуг >= 0 Тогда 
					ОстатокПоЛимиту = "Остаток по лимиту: " + Формат(СтраховойПолис.ЛимитПолиса - СуммаОказанныхУслуг, "ЧЦ=15; ЧДЦ=2; ЧН=") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				Иначе 
					ОстатокПоЛимиту = "Остаток по лимиту: " + Формат(0, "ЧЦ=15; ЧДЦ=2; ЧН=") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				КонецЕсли;
				СтрокаПолис = СтрокаПолис + ЛимитПолиса + "    " + ОстатокПоЛимиту;			
			КонецЕсли;
		    Область_СтраховыеПолисы_Строка.Параметры.СтрокаПолис = СтрокаПолис;
		    ТабличныйДокумент.Вывести(Область_СтраховыеПолисы_Строка);
		
		КонецЦикла;
		
	КонецЕсли;
	
	// =============================================ВЫВОД ИСТОРИИ ВЗАИМОДЕЙСТВИЙ========================================
	Если ВыборкаВзаимодействия.Количество() > 0 Тогда
		
		// ИсторияВзаимодействий_Заголовок	
		ОбластьИсторияВзаимодействий_Заголовок = Макет.ПолучитьОбласть("ИсторияВзаимодействий_Заголовок");
		
		ТабличныйДокумент.Вывести(ОбластьИсторияВзаимодействий_Заголовок);
		
		Пока ВыборкаВзаимодействия.Следующий() Цикл
			
			ОбластьИсторияПриемов_Документ = Макет.ПолучитьОбласть("ИсторияВзаимодействий_Документ");
			
			ОбластьИсторияПриемов_Документ.Параметры.Дата 			= ВыборкаВзаимодействия.Дата;
			ОбластьИсторияПриемов_Документ.Параметры.Взаимодействие	= ВыборкаВзаимодействия.Взаимодействие;
			ОбластьИсторияПриемов_Документ.Параметры.ВидОперации	= ВыборкаВзаимодействия.ВидОперации;
			ОбластьИсторияПриемов_Документ.Параметры.Тема			= ВыборкаВзаимодействия.Тема;
			
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.ПредварительнаяЗапись) Тогда
				ОбластьИсторияПриемов_Документ.Параметры.Запись	=  "Запись на " + Формат(ВыборкаВзаимодействия.ПредварительнаяЗапись.Услуги[0].ДатаНачала,"ДФ=""д ММ гггг 'г.' ЧЧ:мм""");
				ОбластьИсторияПриемов_Документ.Параметры.ЗаписьРасшифровка	= ВыборкаВзаимодействия.ПредварительнаяЗапись
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьИсторияПриемов_Документ);
					
		КонецЦикла;
		
	КонецЕсли;
	
	// ===============================================ВЫВОД ПЛАНОВ ЛЕЧЕНИЯ=================================================	
	Если ВыборкаПланыЛечения.Количество() > 0 Тогда
		СуммаИтого         = 0;
		СуммаОплаченоИтого = 0;
		// СуммаДолгИтого     = 0;
		СуммаСписаноИтого  = 0;
		ОбластьПланыЛечения_Заголовок = Макет.ПолучитьОбласть("ПланыЛечения_Заголовок");
		
		
		ТабличныйДокумент.Вывести(ОбластьПланыЛечения_Заголовок);
		ОбластьПланыЛечения_Шапка = Макет.ПолучитьОбласть("ПланыЛечения_Шапка");
		ТабличныйДокумент.Вывести(ОбластьПланыЛечения_Шапка);
		
		Пока ВыборкаПланыЛечения.Следующий() Цикл
			СуммаИтого 			= СуммаИтого + ВыборкаПланыЛечения.СуммаИтого;
			// СуммаОплаченоИтого 	= СуммаОплаченоИтого + ВыборкаПланыЛечения.Оплачено;
			// СуммаДолгИтого 		= СуммаДолгИтого     + ВыборкаПланыЛечения.Долг;
			// СуммаСписаноИтого   = СуммаСписаноИтого  + ВыборкаПланыЛечения.Списано;		
		КонецЦикла;	
		
		// ОбластьПланыЛечения_Итого = Макет.ПолучитьОбласть("ПланыЛечения_Итого");
		// ОбластьПланыЛечения_Итого.Параметры.СуммаИтого 	= Формат(СуммаИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		// ОбластьИсторияПримов_Итого.Параметры.ОплаченоИтого 	= Формат(СуммаОплаченоИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		// ОбластьИсторияПримов_Итого.Параметры.СписаноИтого 	= Формат(СуммаСписаноИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		// ОбластьИсторияПримов_Итого.Параметры.ДолгИтого 		= Формат(СуммаДолгИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		// Если СуммаДолгИтого > 0 Тогда
		//	ОбластьИсторияПримов_Итого.Область("ОбластьДолгПоДокументуИтого").ЦветТекста = WebЦвета.Красный;
		// ИначеЕсли СуммаДолгИтого < 0 Тогда
		//	ОбластьИсторияПримов_Итого.Область("ОбластьДолгПоДокументуИтого").ЦветТекста = WebЦвета.Фиолетовый;
		// КонецЕсли;		
		// ТабличныйДокумент.Вывести(ОбластьПланыЛечения_Итого);
		ВыборкаПланыЛечения.Сбросить();
		Пока ВыборкаПланыЛечения.Следующий() Цикл
			
			ОбластьПланыЛечения_Документ = Макет.ПолучитьОбласть("ПланыЛечения_Документ");
			
			ОбластьДата 				= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_Дата");
			ОбластьПланЛечения  		= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_ПланЛечения");
			ОбластьСтраховойПолис 		= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_СтраховойПолис");
			ОбластьСтатус 				= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_Статус");
			ОбластьСуммаДокумента  		= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_СуммаДокумента");
			// ОбластьПустая 				= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_Пустая");
			ОбластьПроцентВыполнения 	= Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_ПроцентВыполнения");
			
			// Если ВыборкаПриемы.Долг > 0 Тогда
			//	СтруктураРасшифровки = Новый Структура;
			//	СтруктураРасшифровки.Вставить("ОткрытьСписаниеДолга",Истина);
			//	СтруктураРасшифровки.Вставить("ДокументСсылка"      ,ВыборкаПриемы.ДокументПродажи);
			//	ОбластьИсторияПриемов_Документ.Рисунки["ПиктограммаОткрытьСписаниеДолга"].Расшифровка = СтруктураРасшифровки;
			// Иначе
			//	ОбластьИсторияПриемов_Документ.Рисунки.Удалить(ОбластьИсторияПриемов_Документ.Рисунки["ПиктограммаОткрытьСписаниеДолга"]);
			// КонецЕсли;
			
			ОбластьДата.Параметры.Дата 					= ВыборкаПланыЛечения.ПланЛеченияСсылка.Дата;
			ОбластьПланЛечения.Параметры.ПланЛечения	= Формат(ВыборкаПланыЛечения.ПланЛеченияСсылка.Дата, "ДФ=HH:mm") + ", Врач: " + Строка(ВыборкаПланыЛечения.ПланЛеченияСсылка.Сотрудник);
			Если ЗначениеЗаполнено(ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования) Тогда
				ОбластьСтраховойПолис.Параметры.СтраховаяКомпания  				= Строка(ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования.СтраховаяКомпания) + ", полис №" + Строка(ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования.НомерПолиса) + "-" + Строка(ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования.СерияПолиса) + " до: " + Формат(ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования.ДатаОкончания, "ДФ='dd MMMM yyyy'");			
				ОбластьСтраховойПолис.Параметры.РасшифровкаСтраховаяКомпания	= ВыборкаПланыЛечения.ПланЛеченияСсылка.ПолисМедСтрахования;				
				
				Если ОбластьСтраховойПолис <> Неопределено Тогда 
					НашаОбласть = ОбластьСтраховойПолис.ТекущаяОбласть;					
					НашаОбласть.Гиперссылка = Истина;
					ПодчеркнутыйШрифт = Новый Шрифт(НашаОбласть.Шрифт, , , , , Истина);
					НашаОбласть.Шрифт = ПодчеркнутыйШрифт;
					НашаОбласть.ЦветТекста = Новый Цвет(0, 0, 255);
				КонецЕсли;				
			Иначе
				ОбластьСтраховойПолис = Макет.ПолучитьОбласть("ПланыЛечения_Документ|Область_СтраховойПолис");
				ОбластьСтраховойПолис.Параметры.СтраховаяКомпания  				= "<Отсутствует>";
				ОбластьСтраховойПолис.Параметры.РасшифровкаСтраховаяКомпания	= "";				
				
				Если ОбластьСтраховойПолис <> Неопределено Тогда
					НашаОбласть = ОбластьСтраховойПолис.ТекущаяОбласть;
					НашаОбласть.Гиперссылка = Ложь;
					НеПодчеркнутыйШрифт = Новый Шрифт(НашаОбласть.Шрифт, , , , , Ложь);
					НашаОбласть.Шрифт = НеПодчеркнутыйШрифт;
					НашаОбласть.ЦветТекста = Новый Цвет(0, 0, 0);
				КонецЕсли;
			КонецЕсли;
			ОбластьСтатус.Параметры.СтатусПланаЛечения 				= ВыборкаПланыЛечения.ПланЛеченияСсылка.Статус;
			ОбластьСуммаДокумента.Параметры.СуммаДокумента 			= Формат(ВыборкаПланыЛечения.СуммаИтого, "ЧДЦ=2; ЧРД=.");
			ОбластьПланЛечения.Параметры.РасшифровкаПланаЛечения	= ВыборкаПланыЛечения.ПланЛеченияСсылка;
			
			// Если ВыборкаПриемы.Долг > 0 Тогда
			//	ОбластьИсторияПриемов_Документ.Область("ОбластьДолгПоДокументу").ЦветТекста = WebЦвета.Красный;
			// ИначеЕсли ВыборкаПриемы.Долг < 0 Тогда
			//	ОбластьИсторияПриемов_Документ.Область("ОбластьДолгПоДокументу").ЦветТекста = WebЦвета.Фиолетовый;
			// КонецЕсли;
			
			ВыборкаПоУслугам = ВыборкаПланыЛечения.Выбрать(ОбходРезультатаЗапроса.Прямой);
			ЗаполнитьПроцентВыполненияПланаЛечения(ВыборкаПоУслугам, Макет, ОбластьПроцентВыполнения, Истина, Ложь);
			
			// ТабличныйДокумент.Вывести(ОбластьПланыЛечения_Документ);
			// ТабличныйДокумент.Вывести(СтраховойПолис);

			ТабличныйДокумент.Вывести(ОбластьДата);
			ТабличныйДокумент.Присоединить(ОбластьПланЛечения);
			ТабличныйДокумент.Присоединить(ОбластьСтраховойПолис);
			ТабличныйДокумент.Присоединить(ОбластьСтатус);
			ТабличныйДокумент.Присоединить(ОбластьСуммаДокумента);
			// ТабличныйДокумент.Присоединить(ОбластьПустая);
			ТабличныйДокумент.Присоединить(ОбластьПроцентВыполнения);
			
			
			
		КонецЦикла;
		ОбластьПланыЛечения_Разделитель = Макет.ПолучитьОбласть("ПланыЛечения_Разделитель");
		ТабличныйДокумент.Вывести(ОбластьПланыЛечения_Разделитель);
		
	КонецЕсли;
	
	//===============================================ВЫВОД НАРЯД ЗАКАЗЫ=================================================	
	Если ВыборкаНарядЗаказы.Количество() > 0 Тогда
		ОбластьНарядЗаказы_Заголовок = Макет.ПолучитьОбласть("НарядЗаказы_Заголовок");
		ТабличныйДокумент.Вывести(ОбластьНарядЗаказы_Заголовок);
		ОбластьНарядЗаказы_Шапка = Макет.ПолучитьОбласть("НарядЗаказы_Шапка");
		ТабличныйДокумент.Вывести(ОбластьНарядЗаказы_Шапка);
		Пока ВыборкаНарядЗаказы.СледующийПоЗначениюПоля("Ссылка") Цикл
      
			ОбластьНарядЗаказ_Документ = Макет.ПолучитьОбласть("НарядЗаказ_Документ");
			ОбластьНарядЗаказ_Документ.Параметры.Дата 		= ВыборкаНарядЗаказы.Дата;
			ОбластьНарядЗаказ_Документ.Параметры.Расшифровка = ВыборкаНарядЗаказы.Ссылка;
			ОбластьНарядЗаказ_Документ.Параметры.НарядЗаказ	= Формат(ВыборкаНарядЗаказы.Дата, "ДФ=HH:mm") + ", Врач: " + Строка(ВыборкаНарядЗаказы.Сотрудник);		
			ОбластьНарядЗаказ_Документ.Параметры.СтатусНарядЗаказа = Формат(ВыборкаНарядЗаказы.СтатусНарядЗаказа, "БЛ=Открыт; БИ=Закрыт");
			ТабличныйДокумент.Вывести(ОбластьНарядЗаказ_Документ);

			Пока ВыборкаНарядЗаказы.СледующийПоЗначениюПоля("Номенклатура") Цикл
				ОбластьНарядЗаказ_Услуга = Макет.ПолучитьОбласть("НарядЗаказ_Услуга");
				ОбластьНарядЗаказ_Услуга.Параметры.Услуга          = ВыборкаНарядЗаказы.НомерЗаказа + ":  " + ?(ЗначениеЗаполнено(ВыборкаНарядЗаказы.Зуб), Строка(ВыборкаНарядЗаказы.Зуб) + ", ", "") + Строка(ВыборкаНарядЗаказы.Номенклатура);
				ОбластьНарядЗаказ_Услуга.Параметры.ДатаЗаказа      = Формат(ВыборкаНарядЗаказы.ДатаЗаказа, "ДЛФ=Д");
				ОбластьНарядЗаказ_Услуга.Параметры.ДатаВыполнения  = Формат(ВыборкаНарядЗаказы.ДатаВыполнения, "ДЛФ=Д");
				ОбластьНарядЗаказ_Услуга.Параметры.Статус          = ВыборкаНарядЗаказы.Статус;
			                    
				ТабличныйДокумент.Вывести(ОбластьНарядЗаказ_Услуга);
			КонецЦикла;	  
		КонецЦикла;
	КонецЕсли;
	
	//=============================================ВЫВОД ИСТОРИИ ПРИЕМОВ===============================================	
	Если ВыборкаПриемы.Количество() > 0 Тогда
		СуммаИтого         = 0;
		СуммаОплаченоИтого = 0;
	//	СуммаДолгИтого     = 0;
		СуммаСписаноИтого  = 0;
		ОбластьИсторияПриемов_Заголовок = Макет.ПолучитьОбласть("ИсторияПриемов_Заголовок");
		ОбластьИсторияПриемов_Заголовок.НайтиТекст("Акт сверки взаиморасчетов").Расшифровка = "ОткрытьАктОбОказанныхУслугах";
		СтруктураРасшифровкиОткрытьАктОбОказанныхУслугах = Новый Структура;
		СтруктураРасшифровкиОткрытьАктОбОказанныхУслугах.Вставить("Контрагент", Контрагент);
		СтруктураРасшифровкиОткрытьАктОбОказанныхУслугах.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		ОбластьИсторияПриемов_Заголовок.Параметры.ОткрытьАктОбОказанныхУслугах = СтруктураРасшифровкиОткрытьАктОбОказанныхУслугах;
		
		ТабличныйДокумент.Вывести(ОбластьИсторияПриемов_Заголовок);
		ОбластьИсторияПриемов_Шапка = Макет.ПолучитьОбласть("ИсторияПриемов_Шапка");
		ТабличныйДокумент.Вывести(ОбластьИсторияПриемов_Шапка);
		
		Пока ВыборкаПриемы.Следующий() Цикл
			СуммаИтого 			= СуммаИтого         + ВыборкаПриемы.Сумма;
			СуммаОплаченоИтого 	= СуммаОплаченоИтого + ВыборкаПриемы.Оплачено;
		//	СуммаДолгИтого 		= СуммаДолгИтого     + ВыборкаПриемы.Долг;
			СуммаСписаноИтого   = СуммаСписаноИтого  + ВыборкаПриемы.Списано;		
			
		КонецЦикла;	
				
		ОбластьИсторияПримов_Итого = Макет.ПолучитьОбласть("ИсторияПримов_Итого");
		ОбластьИсторияПримов_Итого.Параметры.СуммаИтого 	= Формат(СуммаИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		ОбластьИсторияПримов_Итого.Параметры.ОплаченоИтого 	= Формат(СуммаОплаченоИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		ОбластьИсторияПримов_Итого.Параметры.СписаноИтого 	= Формат(СуммаСписаноИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
//		ОбластьИсторияПримов_Итого.Параметры.ДолгИтого 		= Формат(СуммаДолгИтого, "ЧДЦ=2; ЧРД=.; ЧН=");
		// Если СуммаДолгИтого > 0 Тогда
		//	ОбластьИсторияПримов_Итого.Область("ОбластьДолгПоДокументуИтого").ЦветТекста = WebЦвета.Красный;
		// ИначеЕсли СуммаДолгИтого < 0 Тогда
		//	ОбластьИсторияПримов_Итого.Область("ОбластьДолгПоДокументуИтого").ЦветТекста = WebЦвета.Фиолетовый;
		// КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьИсторияПримов_Итого);
		ВыборкаПриемы.Сбросить();
		Пока ВыборкаПриемы.Следующий() Цикл
			
			ОбластьИсторияПриемов_Документ = Макет.ПолучитьОбласть("ИсторияПриемов_Документ");
			// Если ВыборкаПриемы.Долг > 0 Тогда
			//	СтруктураРасшифровки = Новый Структура;
			//	СтруктураРасшифровки.Вставить("ОткрытьСписаниеДолга",Истина);
			//	СтруктураРасшифровки.Вставить("ДокументСсылка"      ,ВыборкаПриемы.ДокументПродажи);
			//	ОбластьИсторияПриемов_Документ.Рисунки["ПиктограммаОткрытьСписаниеДолга"].Расшифровка = СтруктураРасшифровки;
			// Иначе
			//	ОбластьИсторияПриемов_Документ.Рисунки.Удалить(ОбластьИсторияПриемов_Документ.Рисунки["ПиктограммаОткрытьСписаниеДолга"]);
			// КонецЕсли;
			ОбластьИсторияПриемов_Документ.Параметры.Дата 					= ВыборкаПриемы.Дата;
			ОбластьИсторияПриемов_Документ.Параметры.Прием 					= ?(ТипЗнч(ВыборкаПриемы.ДокументПродажи.Ссылка) = Тип("ДокументСсылка.Прием"), Формат(ВыборкаПриемы.Дата, "ДФ=HH:mm") + ", Врач: " + Строка(ВыборкаПриемы.Сотрудник), Формат(ВыборкаПриемы.Дата, "ДФ=HH:mm"));
			Если ЗначениеЗаполнено(ВыборкаПриемы.ПолисМедСтрахования) Тогда
				ПолисМедСтрахования = ВыборкаПриемы.ПолисМедСтрахования;
				ОбластьИсторияПриемов_Документ.Параметры.СтраховаяКомпания  = Строка(ПолисМедСтрахования.СтраховаяКомпания) + ", полис №" + ПолисМедСтрахования.НомерПолиса + "-" + ПолисМедСтрахования.СерияПолиса + " до: " + Формат(ПолисМедСтрахования.ДатаОкончания, "ДФ='dd MMMM yyyy'");
			КонецЕсли;
			ОбластьИсторияПриемов_Документ.Параметры.СуммаДокумента 		= Формат(ВыборкаПриемы.Сумма, "ЧДЦ=2; ЧРД=.");
			ОбластьИсторияПриемов_Документ.Параметры.ОплаченоПоДокументу 	= Формат(ВыборкаПриемы.Оплачено, "ЧДЦ=2; ЧРД=.");
		//	ОбластьИсторияПриемов_Документ.Параметры.ДолгПоДокументу 		= Формат(ВыборкаПриемы.Долг, "ЧДЦ=2; ЧРД=.");
			ОбластьИсторияПриемов_Документ.Параметры.СписаноПоДокументу     = Формат(ВыборкаПриемы.Списано, "ЧДЦ=2; ЧРД=.");
			ОбластьИсторияПриемов_Документ.Параметры.РасшифровкаПриема 		= ВыборкаПриемы.ДокументПродажи;
			
			// Если ВыборкаПриемы.Долг > 0 Тогда
			//	ОбластьИсторияПриемов_Документ.Область("ОбластьДолгПоДокументу").ЦветТекста = WebЦвета.Красный;
			// ИначеЕсли ВыборкаПриемы.Долг < 0 Тогда
			//	ОбластьИсторияПриемов_Документ.Область("ОбластьДолгПоДокументу").ЦветТекста = WebЦвета.Фиолетовый;
			// КонецЕсли;		
			ВыборкаПоУслугам = ВыборкаПриемы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоУслугам.СледующийПоЗначениюПоля("Услуга") Цикл
				Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") Тогда
					ОбластьИсторияПриемов_Услуга = Макет.ПолучитьОбласть("ИсторияПриемов_Услуга");
					СтрокаЗуб = "";
					СкидкаСредняя = 0;
					СуммаБезСкидкиПоУслуге = 0;
					СуммаСоСкидкойПоУслуге = 0;
					Пока ВыборкаПоУслугам.СледующийПоЗначениюПоля("НомерЗуба") Цикл 
						СуммаБезСкидкиПоУслуге = СуммаБезСкидкиПоУслуге + ВыборкаПоУслугам.СуммаБезСкидки;
						СуммаСоСкидкойПоУслуге = СуммаСоСкидкойПоУслуге + ВыборкаПоУслугам.СуммаСоСкидкой;
						Если СтрокаЗуб = "" Тогда
							СтрокаЗуб = Строка(?(ВыборкаПоУслугам.НомерЗуба = Перечисления.Зубы.ВсяПолость, "", ВыборкаПоУслугам.НомерЗуба));
						Иначе 
							СтрокаЗуб = СтрокаЗуб + ?(ЗначениеЗаполнено(?(ВыборкаПоУслугам.НомерЗуба = Перечисления.Зубы.ВсяПолость, "", ВыборкаПоУслугам.НомерЗуба)), ", ", "") + Строка(?(ВыборкаПоУслугам.НомерЗуба = Перечисления.Зубы.ВсяПолость, "", ВыборкаПоУслугам.НомерЗуба));
						КонецЕсли;
					КонецЦикла;
					Если СуммаБезСкидкиПоУслуге - СуммаСоСкидкойПоУслуге = 0 Тогда
						ОбластьИсторияПриемов_Услуга.Параметры.Услуга = ?(ЗначениеЗаполнено(СтрокаЗуб), СтрокаЗуб + ": ", "") + Строка(ВыборкаПоУслугам.Услуга);
					Иначе
						Если СуммаБезСкидкиПоУслуге <> 0 и СуммаСоСкидкойПоУслуге <> 0 и СуммаБезСкидкиПоУслуге <> Неопределено Тогда
							СкидкаСредняя =  (СуммаБезСкидкиПоУслуге - СуммаСоСкидкойПоУслуге) / СуммаБезСкидкиПоУслуге * 100;
						КонецЕсли;
						ОбластьИсторияПриемов_Услуга.Параметры.Услуга = ?(ЗначениеЗаполнено(СтрокаЗуб), Строка(СтрокаЗуб) + ": ", "") + Строка(ВыборкаПоУслугам.Услуга);
						СкидкаОкр = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(СкидкаСредняя, Перечисления.ПорядкиОкругления.Окр0_1, Истина);			   
						ОбластьИсторияПриемов_Услуга.Параметры.ПроцентСкидки = "-" + СкидкаОкр + "%";
					КонецЕсли;				   
					ОбластьИсторияПриемов_Документ.Присоединить(ОбластьИсторияПриемов_Услуга);						
				КонецЕсли;					
			КонецЦикла;				
			ТабличныйДокумент.Вывести(ОбластьИсторияПриемов_Документ);			
		КонецЦикла;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает текст запроса
//
Функция ПолучитьЗапросОбщейИнформации() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусКлиента.Статус КАК Статус,
	|	СтатусКлиента.Контрагент КАК Контрагент,
	|	МИНИМУМ(Продажи.Период) КАК ДатаПервогоПосещения,
	|	МАКСИМУМ(Продажи.Период) КАК ДатаПоследнегоПосещения,
	|	ЛицСчет.СуммаОстаток КАК Остаток,
	|	ДатаРегистрации.Период КАК ДатаРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		НЕОПРЕДЕЛЕНО КАК ПустоеПоле) КАК ПустаяКолонка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, ) КАК СтатусКлиента
	|		ПО (СтатусКлиента.Контрагент = &Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО (Продажи.Контрагент = &Клиент)
	|			И (ВЫБОР
	|				КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|					ТОГДА Продажи.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(, Контрагент = &Клиент) КАК ЛицСчет
	|		ПО (ЛицСчет.Контрагент = &Клиент)
	|			И (ВЫБОР
	|				КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЛицСчет.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентов.СрезПервых КАК ДатаРегистрации
	|		ПО (ДатаРегистрации.Контрагент = &Клиент)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусКлиента.Статус,
	|	СтатусКлиента.Контрагент,
	|	ДатаРегистрации.Период,
	|	ЛицСчет.СуммаОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Предпочтения.Сотрудник.Наименование КАК ФамилияМастера,
	|	Предпочтения.Сотрудник.Должность.Наименование КАК ДолжностьМастера
	|ИЗ
	|	РегистрСведений.ПредпочтенияКлиентовПоМастерам КАК Предпочтения
	|ГДЕ
	|	Предпочтения.Контрагент = &Клиент
	|	И ВЫБОР
	|			КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|				ТОГДА Предпочтения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыСегмента.Сегмент КАК Сегмент
	|ИЗ
	|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
	|ГДЕ
	|	КонтрагентыСегмента.Контрагент = &Клиент
	|	И НЕ КонтрагентыСегмента.Сегмент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиОбороты.ДокументПродажи.Дата КАК Дата,
	|	ПродажиОбороты.ДокументПродажи.Сотрудник КАК Сотрудник,
	|	СУММА(ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаДокумента, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаОплачено, 0)) КАК Оплачено,
	|	СУММА(-ЕСТЬNULL(ЗадолженностьПоДокументу.СуммаЗадолженности, 0)) КАК Долг,
	|	СУММА(ЕСТЬNULL(ЗадолженностьПоДокументу.СуммаСписания, 0)) КАК Списано,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.СтоимостьБезСкидкиОборот - ПродажиОбороты.СтоимостьОборот <= 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПродажиОбороты.СтоимостьБезСкидкиОборот <> 0
	|						ТОГДА (ПродажиОбороты.СтоимостьБезСкидкиОборот - ПродажиОбороты.СтоимостьОборот) / ПродажиОбороты.СтоимостьБезСкидкиОборот * 100
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Скидка,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
	|	ПродажиОбороты.Номенклатура КАК Услуга,
	|	ПродажиОбороты.НомерЗуба КАК НомерЗуба,
	|	СУММА(ПродажиОбороты.СтоимостьОборот * ПродажиОбороты.КоличествоОборот) КАК СуммаСоСкидкой,
	|	СУММА(ПродажиОбороты.СтоимостьБезСкидкиОборот * ПродажиОбороты.КоличествоОборот) КАК СуммаБезСкидки,
	|	ПродажиОбороты.ДокументПродажи.ПолисМедСтрахования КАК ПолисМедСтрахования
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			Авто,
	|			Контрагент = &Клиент
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И (ДокументПродажи ССЫЛКА Документ.Прием
	|					ИЛИ ДокументПродажи ССЫЛКА Документ.Реализация)) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации КАК ДокументРеализации,
	|			СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаОборот, 0)) КАК СуммаЗадолженности,
	|			СУММА(ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
	|						ТОГДА -ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаСписания
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|					,
	|					,
	|					Авто,
	|					ВЫБОР
	|							КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|								ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И Контрагент = &Клиент) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации) КАК ЗадолженностьПоДокументу
	|		ПО ПродажиОбороты.ДокументПродажи = ЗадолженностьПоДокументу.ДокументРеализации
	|ГДЕ
	|	НЕ ПродажиОбороты.ДокументПродажи В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВозвратОтПокупателя.ДокументОснования КАК ДокументОснования
	|				ИЗ
	|					Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|				ГДЕ
	|					НЕ ВозвратОтПокупателя.ПометкаУдаления
	|					И ВозвратОтПокупателя.Проведен
	|					И ВозвратОтПокупателя.ДокументОснования ССЫЛКА Документ.Прием
	|					И ВозвратОтПокупателя.Контрагент = &Клиент
	|					И ВозвратОтПокупателя.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.ДокументПродажи.Дата,
	|	ПродажиОбороты.ДокументПродажи.Сотрудник,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.НомерЗуба,
	|	ПродажиОбороты.ДокументПродажи.ПолисМедСтрахования
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Долг),
	|	МАКСИМУМ(Списано)
	|ПО
	|	ДокументПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.Ссылка КАК Взаимодействие,
	|	Взаимодействие.Дата КАК Дата,
	|	Взаимодействие.ВидОперации КАК ВидОперации,
	|	Взаимодействие.Задача КАК Тема,
	|	Взаимодействие.ПредварительнаяЗаписьНаСледующийПрием КАК ПредварительнаяЗапись
	|ИЗ
	|	Документ.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Взаимодействие.ЗадачаПредмет = &Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланЛеченияЛечение.Ссылка КАК ПланЛеченияСсылка,
	|	ПланЛеченияЛечение.Зуб КАК НомерЗуба,
	|	ПланЛеченияЛечение.Номенклатура КАК Услуга,
	|	ПланЛеченияЛечение.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки > 0
	|				И ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена <> 0
	|			ТОГДА ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки / (ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена / 100)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентСкидки,
	|	ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки КАК СуммаАвтСкидки,
	|	ПланЛеченияЛечение.Всего КАК СуммаИтого,
	|	ПланЛеченияЛечение.Прием КАК Прием
	|ИЗ
	|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
	|ГДЕ
	|	ПланЛеченияЛечение.Ссылка.Контрагент = &Клиент
	|	И ВЫБОР
	|			КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|				ТОГДА ПланЛеченияЛечение.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Рассматривается)
	|			ИЛИ ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Принят)
	|			ИЛИ ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Отвергнут)
	|			ИЛИ ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Закрыт))
	|	И НЕ ПланЛеченияЛечение.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланЛеченияЛечение.Ссылка.Дата УБЫВ
	|ИТОГИ
	|	СУММА(СуммаИтого)
	|ПО
	|	ПланЛеченияСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НарядЗаказЗапасы.Зуб КАК Зуб,
	|	НарядЗаказЗапасы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(НарядЗаказЗапасы.ДатаВыполнения) КАК ДатаВыполнения,
	|	НарядЗаказЗапасы.Статус КАК Статус,
	|	НарядЗаказЗапасы.НомерЗаказа КАК НомерЗаказа,
	|	НарядЗаказЗапасы.Ссылка.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(НарядЗаказЗапасы.ДатаЗаказа) КАК ДатаЗаказа,
	|	НарядЗаказЗапасы.Ссылка.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НарядЗаказЗапасы.Ссылка.Дата) КАК Дата,
	|	НарядЗаказЗапасы.Ссылка.Статус КАК СтатусНарядЗаказа
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|				ТОГДА НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ НарядЗаказЗапасы.Ссылка.ПометкаУдаления
	|	И НарядЗаказЗапасы.Ссылка.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И НарядЗаказЗапасы.Ссылка.Контрагент = &Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.Зуб,
	|	НарядЗаказЗапасы.Статус,
	|	НарядЗаказЗапасы.НомерЗаказа,
	|	НарядЗаказЗапасы.Ссылка.Сотрудник,
	|	НарядЗаказЗапасы.Ссылка.Ссылка,
	|	НарядЗаказЗапасы.Ссылка.Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	ДатаЗаказа УБЫВ,
	|	ДатаВыполнения УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Профосмотры.ДатаЗапланированная КАК ДатаЗапланированная,
	|	Профосмотры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Профосмотры.Контрагент КАК Контрагент,
	|	Профосмотры.Сотрудник КАК Сотрудник,
	|	Профосмотры.ВидОсмотра КАК ВидОсмотра,
	|	Профосмотры.Период КАК Период
	|ИЗ
	|	РегистрСведений.Профосмотры КАК Профосмотры
	|ГДЕ
	|	Профосмотры.Контрагент = &Клиент
	|	И Профосмотры.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Профосмотр)
	|	И Профосмотры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗапланированная";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//
//
Функция ПолучитьСуммуОказанныхУслугПоПолису(СтраховойПолис)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(СУММА(ПродажиОбороты.СтоимостьОборот), 0) КАК СтоимостьОборот
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			,
	               |			,
	               |			Авто,
	               |			ДокументПродажи ССЫЛКА Документ.Прием
	               |				И ДокументПродажи.ПолисМедСтрахования = &ПолисМедСтрахования) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("ПолисМедСтрахования", СтраховойПолис);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда 
		Сумма = Результат.Выбрать();
		Сумма.Следующий();
		Возврат Сумма.СтоимостьОборот;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции


// Функция - Заполнить процент выполнения плана лечения
//
// Параметры:
//  ВыборкаПоУслугам - 	 - 
//  Макет			 - 	 - 
//  ОбластьДокумента - 	 - 
//  ПоСумме			 - 	 - 
//  ПоУслугам		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаполнитьПроцентВыполненияПланаЛечения(ВыборкаПоУслугам, Макет = Неопределено, ОбластьДокумента = Неопределено, ПоСумме = Истина, ПоУслугам = Истина) Экспорт 
	
	ОбщаяСумма 					= 0;
	СуммаВыполненных 			= 0;
	ОбщееКоличествоУслуг 		= 0;
	КоличествоВыполненныхУслуг 	= 0;
	ПроцентВыполнения           = Неопределено;
	
	Пока ВыборкаПоУслугам.Следующий() Цикл					
		Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") Тогда
			ОбщаяСумма 					= ОбщаяСумма + ВыборкаПоУслугам.СуммаИтого;
			СуммаВыполненных 			= ?(ЗначениеЗаполнено(ВыборкаПоУслугам.Прием), СуммаВыполненных + ВыборкаПоУслугам.СуммаИтого, СуммаВыполненных);
			ОбщееКоличествоУслуг 		= ОбщееКоличествоУслуг + 1;
			КоличествоВыполненныхУслуг 	= ?(ЗначениеЗаполнено(ВыборкаПоУслугам.Прием), КоличествоВыполненныхУслуг + 1, КоличествоВыполненныхУслуг);			
		КонецЕсли;					
	КонецЦикла;
	
	Если ПоСумме И НЕ ПоУслугам и ОбщаяСумма <> 0 Тогда
		ПроцентВыполнения = ?(ОбщаяСумма = 0, Формат(0, "ЧЦ=3; ЧН=0"), Формат(СуммаВыполненных / (ОбщаяСумма / 100), "ЧЦ=3; ЧН=0")) + "%";
		
	ИначеЕсли ПоУслугам И НЕ ПоСумме и ОбщееКоличествоУслуг <> 0 Тогда
		ПроцентВыполнения = ?(ОбщееКоличествоУслуг = 0, Формат(0, "ЧЦ=3; ЧН=0"), Формат(КоличествоВыполненныхУслуг / (ОбщееКоличествоУслуг / 100), "ЧЦ=3; ЧН=0")) + "%";
	ИначеЕсли ПоСумме И ПоУслугам и ОбщаяСумма <> 0 и ОбщееКоличествоУслуг <> 0 Тогда 
		ПроцентВыполненияПоСумме 	= ?(ОбщаяСумма = 0, 0, СуммаВыполненных / (ОбщаяСумма / 100));
		ПроцентВыполненияПоУслугам 	= ?(ОбщееКоличествоУслуг = 0, 0, КоличествоВыполненныхУслуг / (ОбщееКоличествоУслуг / 100));
		ПроцентВыполнения = Формат((ПроцентВыполненияПоСумме + ПроцентВыполненияПоУслугам) / 2, "ЧЦ=3; ЧН=0") + "%";
	КонецЕсли;
	
	Если ОбластьДокумента <> Неопределено Тогда 
		ОбластьДокумента.Параметры.ПроцентВыполнения = ПроцентВыполнения;
	КонецЕсли;
	
	Возврат ПроцентВыполнения; 
	
КонецФункции
//
//
Процедура ВыводОбщейИнформацииПоКонтрагенту(ОбластьЗаголовок, Контрагент, Адрес, Телефон, Емайл)
	
	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда		
		ОбластьEmailКонтрагента = ОбластьЗаголовок.НайтиТекст("EmailКонтрагента");
		ОбластьEmailКонтрагента.Гиперссылка = Ложь;
		ОбластьEmailКонтрагента.ЦветТекста = Новый Цвет(0,0,0);
		ОбластьEmailКонтрагента.Шрифт = Новый Шрифт(ОбластьEmailКонтрагента.Шрифт, "НовыйШрифт", , , , Ложь);
		
		ОбластьЗаголовок.Параметры.Адрес        	= "<Недоступно>";
		ОбластьЗаголовок.Параметры.Телефон      	= "<Недоступно>";		
		ОбластьЗаголовок.Параметры.EmailКонтрагента	= "<Недоступно>";
		ОбластьЗаголовок.Параметры.СтруктураEmail 	= "<Недоступно>";
		ОбластьЗаголовок.Параметры.Другое       	= "<Недоступно>";
		ОбластьЗаголовок.Параметры.ДатаРождения 	= Контрагент.ДатаРожденияКлиента;		
	Иначе		
		ОбластьЗаголовок.Параметры.Адрес        	= Адрес;
		ОбластьЗаголовок.Параметры.Телефон      	= Телефон;
		ОбластьЗаголовок.Параметры.EmailКонтрагента	= Емайл;
		ОбластьЗаголовок.Параметры.СтруктураEmail 	= Новый Структура("СсылкаНаEmail", Емайл);
		ОбластьЗаголовок.Параметры.Другое       	= Контрагент.Комментарий;
		ОбластьЗаголовок.Параметры.ДатаРождения 	= Контрагент.ДатаРожденияКлиента;
	КонецЕсли;
	                      
КонецПроцедуры 

#КонецОбласти
